/*
Проект: bookingcar
Автор: pymba86
*/

----------------------------------------------------------------------
-- Создание
----------------------------------------------------------------------

-- Создание справочной таблицы "Категория автомобиля"
CREATE TABLE car_category
(
  id                    NUMBER(10) PRIMARY KEY NOT NULL,
  code                  VARCHAR2(25)           NOT NULL,
  description           VARCHAR2(100)          NOT NULL,
  driver_age_min        NUMBER(3),
  driver_experience_min NUMBER(3)
);

----------------------------------------------------------------------
-- Заполнение
----------------------------------------------------------------------

-- Заполнение данными таблицы "Категория автомобиля"
INSERT INTO car_category VALUES (1, 'A', 'Эконом', 21, 2);
INSERT INTO car_category VALUES (1, 'B', 'Средний', 21, 2);
INSERT INTO car_category VALUES (1, 'C', 'Бизнес', 23, 3);

----------------------------------------------------------------------
-- Примеры запросов и работы с данными
----------------------------------------------------------------------

-- Получить машины, которые принадлежат данной категории

-- Получить среднюю цену данной категории

-- Средний возвраст водителя

-- Минимальный ценник по данной категории