/*
Проект: bookingcar
Автор: pymba86
*/

----------------------------------------------------------------------
-- Создание
----------------------------------------------------------------------

-- Создание таблицы "Комплектация автомобиля"
CREATE TABLE car_comp_option
(
  id        NUMBER(10) NOT NULL PRIMARY KEY,
  car_id    NUMBER(10) NOT NULL,
  option_id NUMBER(10) NOT NULL
);

----------------------------------------------------------------------
-- Заполнение
----------------------------------------------------------------------

----------------------------------------------------------------------
-- Примеры запросов и работы с данными
----------------------------------------------------------------------

